'''
רשימות בסיס-
a. צור רשימה ריקה והכנס לתוכה את המספרים 1-100 בלולאת for באמצעות append
b. הדפס את האיבר הראשון ברשימה שייצרת )רמז אינדקס 0(
c. הדפס את האיבר האחרון ברשימה שייצרת )רמז אינדקס -1(
d. הדפס כמה איברים יש ברשימה )רמז: len )
e. צור והדפס רשימה של המספרים 3-12 כולל )רמז: נקודותיים ]סיום:התחלה[ (
f. צור והדפס רשימה של המספרים 80 ועד לסוף הרשימה )רמז: נקודותיים חצי ריק (
g. צור והדפס רשימה של המספרים מתחילת הרשימה ועד אינדקס 17
h. הדפס את הרשימה בסדר הפוך )רמז פעמיים נקודותיים עם -1 (
i. הדפס את כל המספרים הזוגיים ב רשימה כלומר ,2 ,4 ,6 8 ... )רמז: התחל מאינדקס
של המספר 2 וקפוץ בדילוגים של 2 השתמש בפעמיים נקודותיים 0:100:2(
j. הדפס את כל המספרים המתחלקים ב 3 ללא שארית , כלומר ,3 ,6 ,9 12 ...
k. הדפס את כל המספרים המתחלקים ב 7 ללא שארית , כלומר ,7 ,14 21 ...
l. הדפס את כל הכפולות של ,10 כלומר ,10 ,20 30 ...
m. הדפס את המספרים מ 99 ועד 66 בדילוגים של ,3 כלומר ,99 ,96 ...,93ועד 66
n. הכנס את המספר 999 במרכז הרשימה )רמז insert )
o. הוצא את המספר 100 מהרשימה )רמז: pop )
'''

lst: list = []

for x in range(1, 100 + 1): # a
    lst.append(x)

print(lst[0]) # b
print(lst[-1]) # c
print(len(lst)) # d

e_list = lst[2:12]
print(e_list) # e

task_f_list = lst[79:]
print(task_f_list) # f

task_g_list = lst[:17]
print(task_g_list) # g

print(lst[::-1]) # h
print(lst[1:100:2]) # i
print(lst[2:100:3]) # j         #for x in lst: if x % 3 == 0: print(x)
print(lst[6:100:7]) # k         #for x in lst: if x % 7 == 0: print(x)
print(lst[9:100:10]) # l        #for x in lst: if x % 10 == 0: print(x)
print(lst[98:64:-3]) # m

lst.insert((len(lst) // 2), 999) # m         ### There's no really "center" since 101 is an odd number but I guess that the best i can do.
#print(lst)

lst.pop(100) # o
#print(lst)